#pragma once
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#include <inttypes.h>
#include "../core.h"
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
class Transport
{
	public:
		virtual void begin() = 0; // начинает работу транспорта
		virtual bool write(const uint8_t* payload, uint16_t payloadLength) = 0; // пишет данные в эфир
		virtual uint8_t* read(uint16_t& readed) = 0; // возвращает данные принятого пакета
		virtual bool available() = 0; // если есть пакет - возвращает true
		virtual void update() = 0; // обновляет транспорт
		virtual void wipe() = 0; // очищает принятые данные пакета
	
};
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
